/*
Упражнение 2.1. Напишите программу, которая будет выдавать диапазоны значений типов char, short,
int и long, описанных как signed и как unsigned, с помощью печати соответствующих значений из
стандартных заголовочных файлов и путем прямого вычисления. Определите диапазоны чисел с плавающей
точкой различных типов. Вычислить эти диапазоны сложнее.
*/

#include <stdio.h>
#include <limits.h>
#include <float.h>


int main(void) {
	int i;
	i = 0;
	while(i > 0; ++i) {
		if(i == i + 1) {
			printf("%d", i);
		};
	}
	printf("%d", i);
	return 0;
}