/*Упражнение 1.7. Напишите программу, печатающую значение EOF.*/

#include <stdio.h>

int main(void) {
	int val = EOF;
	printf("%d\n", val);
	return 0;
}